name: "dummy"
input: "data"
input_shape {
  dim: 1
  dim: 3
#  dim: 321
#  dim: 321
#  dim: 337
#  dim: 385
#    dim: 361
#    dim: 361
  #dim: 385
  #dim: 385
dim: 193
dim: 193
}

#input: "gt_boxes"
#input_shape {
#  dim: 1 # to be changed on-the-fly to num ROIs
#  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
#}

input: "im_info"
input_shape {
  dim: 1 # to be changed on-the-fly to num ROIs
  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
}

#input: "rois_ssearch"
#input_shape {
#  dim: 1 # to be changed on-the-fly to num ROIs
#  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
#}
# start of piece_FEATS_template.prototxt #

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  deletetop:    true
  top: "conv1_1"
  param {
    name: "conv1_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  deletetop:    false
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  deletebottom: true
  deletetop:    true
  top: "conv1_2"
  param {
    name: "conv1_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
	pad: 1
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  deletebottom: true
  deletetop:    true
  top: "conv2_1"
  param {
    name: "conv2_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  deletetop:  false
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  deletebottom: true
  deletetop:    true
  top: "conv2_2"
  param {
    name: "conv2_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
	 pad: 1
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  deletebottom: true
  deletetop:    true
  top: "conv3_1"
  param {
    name: "conv3_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  deletebottom: true
  deletetop:    true
  top: "conv3_2"
  param {
    name: "conv3_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  deletebottom: true
  deletetop:    true
  top: "conv3_3"
  param {
    name: "conv3_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  deletebottom: true
  deletetop:    true
  top: "conv4_1"
  param {
    name: "conv4_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  deletebottom: true
  deletetop:    true
  top: "conv4_2"
  param {
    name: "conv4_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  deletebottom: true
  deletetop:    true
  top: "conv4_3"
  param {
    name: "conv4_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1 #2->1
	pad: 1
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  deletebottom: true
  deletetop:    true
  top: "conv5_1"
  param {
    name: "conv5_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2  #1->2
	  dilation: 2	  #1->2
    kernel_size: 3
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  deletetop:    false
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  deletebottom: true
  deletetop:    true
  top: "conv5_2"
  param {
    name: "conv5_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
	dilation: 2
    kernel_size: 3
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv5_2"
  deletebottom: true
  deletetop:    true
  top: "conv5_3"
  param {
    name: "conv5_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
	dilation: 2
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  deletetop:    false
  type: "ReLU"
}

# end of piece_FEATS_template.prototxt

# start of piece_FC_template.prototxt #
layer {
  bottom: "conv5_3"
#  top: "cue5"
  top: "pool5"
#  name: "cue5"
  name: "pool5"
  type: "Pooling"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  bottom: "pool5"
  top: "cue5"
  name: "cue5"
  deletetop:    true
  deletebottom:  true
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  bottom: "cue5"
  deletetop:    true
  deletebottom: true
  top: "fc6_conv"
  name: "fc6_conv"
  type: "Convolution"
  param {
    name: "fc6_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
 convolution_param {
    num_output: 1024 # small: 4096    large: 1024
    pad: 12      # small: 6       large: 12
    dilation: 12    # small: 4 (2x3) large: 12
    kernel_size: 3 # small: 4      large: 3
  }
}

layer {
  name: "relu6_conv"
  type: "ReLU"
  bottom: "fc6_conv"
  deletetop:    false
  top: "fc6_conv"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6_conv"
  top: "fc6_conv"
  deletetop:    false
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fc7_conv"
  type: "Convolution"
  bottom: "fc6_conv"
  top: "fc7_conv"
  deletetop:    true
  deletebottom: true
  param {
    name: "fc7_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024	 # small: 4096    large: 1024
    kernel_size: 1
  }
}

layer {
  name: "relu7_conv"
  type: "ReLU"
  deletetop:    false
  bottom: "fc7_conv"
  top: "fc7_conv"
}

layer {
  name: "drop7_conv"
  type: "Dropout"
  bottom: "fc7_conv"
  top: "fc7_conv"
  deletetop:    false
  dropout_param {
    dropout_ratio: 0.5
  }
}


# end of piece_FC_template.prototxt

# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv1_2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv1_2"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv1_2"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv1_2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv1_2"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv1_2"
}

layer{
  name: "conv1_2_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv1_2"
  top:       "conv1_2_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1"
}

#layer{
# name: "conv1_2_sil"
# type: "Silence"
# bottom: "conv1_2_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv2_2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv2_2"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv2_2"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv2_2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv2_2"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv2_2"
}

layer{
  name: "conv2_2_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv2_2"
  top:       "conv2_2_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1"
}

#layer{
# name: "conv2_2_sil"
# type: "Silence"
# bottom: "conv2_2_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv3_3"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv3_3"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv3_3"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv3_3"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv3_3"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv3_3"
}

layer{
  name: "conv3_3_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv3_3"
  top:       "conv3_3_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1"
}

#layer{
# name: "conv3_3_sil"
# type: "Silence"
# bottom: "conv3_3_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv4_3"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv4_3"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv4_3"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv4_3"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv4_3"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv4_3"
}

layer{
  name: "conv4_3_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv4_3"
  top:       "conv4_3_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1"
}

#layer{
# name: "conv4_3_sil"
# type: "Silence"
# bottom: "conv4_3_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv5_3"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv5_3"
  deletebottom:    true
  #deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv5_3"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv5_3"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv5_3"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv5_3"
}

layer{
  name: "conv5_3_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv5_3"
  top:       "conv5_3_scl"
  deletebottom: true
  deletetop:    true
  pullsfrom: "conv1_1"
}

#layer{
# name: "conv5_3_sil"
# type: "Silence"
# bottom: "conv5_3_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_RES_template.prototxt #

layer {
  name: "pool_RS2"
  type: "Pooling"
  bottom: "data"
  top: "data_RS2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
# end of piece_RES_template.prototxt

# start of piece_FEATS_template.prototxt #

layer {
  name: "conv1_1_RS2"
  type: "Convolution"
  bottom: "data_RS2"
  deletetop:    true
  top: "conv1_1_RS2"
  param {
    name: "conv1_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv1_1_RS2"
  top: "conv1_1_RS2"
}
layer {
  name: "conv1_2_RS2"
  type: "Convolution"
  bottom: "conv1_1_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv1_2_RS2"
  param {
    name: "conv1_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv1_2_RS2"
  top: "conv1_2_RS2"
}
layer {
  name: "pool1_RS2"
  type: "Pooling"
  bottom: "conv1_2_RS2"
  top: "pool1_RS2"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
	pad: 1
  }
}
layer {
  name: "conv2_1_RS2"
  type: "Convolution"
  bottom: "pool1_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv2_1_RS2"
  param {
    name: "conv2_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1_RS2"
  type: "ReLU"
  deletetop:  false
  bottom: "conv2_1_RS2"
  top: "conv2_1_RS2"
}
layer {
  name: "conv2_2_RS2"
  type: "Convolution"
  bottom: "conv2_1_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv2_2_RS2"
  param {
    name: "conv2_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv2_2_RS2"
  top: "conv2_2_RS2"
}
layer {
  name: "pool2_RS2"
  type: "Pooling"
  bottom: "conv2_2_RS2"
  top: "pool2_RS2"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
	 pad: 1
  }
}
layer {
  name: "conv3_1_RS2"
  type: "Convolution"
  bottom: "pool2_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv3_1_RS2"
  param {
    name: "conv3_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_1_RS2"
  top: "conv3_1_RS2"
}
layer {
  name: "conv3_2_RS2"
  type: "Convolution"
  bottom: "conv3_1_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv3_2_RS2"
  param {
    name: "conv3_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_2_RS2"
  top: "conv3_2_RS2"
}
layer {
  name: "conv3_3_RS2"
  type: "Convolution"
  bottom: "conv3_2_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv3_3_RS2"
  param {
    name: "conv3_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_3_RS2"
  top: "conv3_3_RS2"
}
layer {
  name: "pool3_RS2"
  type: "Pooling"
  bottom: "conv3_3_RS2"
  top: "pool3_RS2"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv4_1_RS2"
  type: "Convolution"
  bottom: "pool3_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv4_1_RS2"
  param {
    name: "conv4_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_1_RS2"
  top: "conv4_1_RS2"
}
layer {
  name: "conv4_2_RS2"
  type: "Convolution"
  bottom: "conv4_1_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv4_2_RS2"
  param {
    name: "conv4_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_2_RS2"
  top: "conv4_2_RS2"
}
layer {
  name: "conv4_3_RS2"
  type: "Convolution"
  bottom: "conv4_2_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv4_3_RS2"
  param {
    name: "conv4_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_3_RS2"
  top: "conv4_3_RS2"
}
layer {
  name: "pool4_RS2"
  type: "Pooling"
  bottom: "conv4_3_RS2"
  top: "pool4_RS2"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1 #2->1
	pad: 1
  }
}
layer {
  name: "conv5_1_RS2"
  type: "Convolution"
  bottom: "pool4_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv5_1_RS2"
  param {
    name: "conv5_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2  #1->2
	  dilation: 2	  #1->2
    kernel_size: 3
  }
}
layer {
  name: "relu5_1_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv5_1_RS2"
  top: "conv5_1_RS2"
}
layer {
  name: "conv5_2_RS2"
  type: "Convolution"
  bottom: "conv5_1_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv5_2_RS2"
  param {
    name: "conv5_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
	dilation: 2
    kernel_size: 3
  }
}
layer {
  name: "relu5_2_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "conv5_2_RS2"
  top: "conv5_2_RS2"
}
layer {
  name: "conv5_3_RS2"
  type: "Convolution"
  bottom: "conv5_2_RS2"
  deletebottom: true
  deletetop:    true
  top: "conv5_3_RS2"
  param {
    name: "conv5_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
	dilation: 2
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3_RS2"
  top: "conv5_3_RS2"
  name: "relu5_3_RS2"
  deletetop:    false
  type: "ReLU"
}

# end of piece_FEATS_template.prototxt

# start of piece_FC_template.prototxt #
layer {
  bottom: "conv5_3_RS2"
#  top: "cue5_RS2"
  top: "pool5_RS2"
#  name: "cue5_RS2"
  name: "pool5_RS2"
  type: "Pooling"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  bottom: "pool5_RS2"
  top: "cue5_RS2"
  name: "cue5_RS2"
  deletetop:    true
  deletebottom:  true
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  bottom: "cue5_RS2"
  deletetop:    true
  deletebottom: true
  top: "fc6_conv_RS2"
  name: "fc6_conv_RS2"
  type: "Convolution"
  param {
    name: "fc6_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
 convolution_param {
    num_output: 1024 # small: 4096    large: 1024
    pad: 12      # small: 6       large: 12
    dilation: 12    # small: 4 (2x3) large: 12
    kernel_size: 3 # small: 4      large: 3
  }
}

layer {
  name: "relu6_conv_RS2"
  type: "ReLU"
  bottom: "fc6_conv_RS2"
  deletetop:    false
  top: "fc6_conv_RS2"
}
layer {
  name: "drop6_RS2"
  type: "Dropout"
  bottom: "fc6_conv_RS2"
  top: "fc6_conv_RS2"
  deletetop:    false
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fc7_conv_RS2"
  type: "Convolution"
  bottom: "fc6_conv_RS2"
  top: "fc7_conv_RS2"
  deletetop:    true
  deletebottom: true
  param {
    name: "fc7_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024	 # small: 4096    large: 1024
    kernel_size: 1
  }
}

layer {
  name: "relu7_conv_RS2"
  type: "ReLU"
  deletetop:    false
  bottom: "fc7_conv_RS2"
  top: "fc7_conv_RS2"
}

layer {
  name: "drop7_conv_RS2"
  type: "Dropout"
  bottom: "fc7_conv_RS2"
  top: "fc7_conv_RS2"
  deletetop:    false
  dropout_param {
    dropout_ratio: 0.5
  }
}


# end of piece_FC_template.prototxt

# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv1_2_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv1_2_RS2"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv1_2_RS2"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv1_2_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv1_2_RS2"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv1_2_RS2"
}

layer{
  name: "conv1_2_RS2_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv1_2_RS2"
  top:       "conv1_2_RS2_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS2"
}

#layer{
# name: "conv1_2_RS2_sil"
# type: "Silence"
# bottom: "conv1_2_RS2_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv2_2_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv2_2_RS2"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv2_2_RS2"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv2_2_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv2_2_RS2"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv2_2_RS2"
}

layer{
  name: "conv2_2_RS2_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv2_2_RS2"
  top:       "conv2_2_RS2_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS2"
}

#layer{
# name: "conv2_2_RS2_sil"
# type: "Silence"
# bottom: "conv2_2_RS2_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv3_3_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv3_3_RS2"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv3_3_RS2"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv3_3_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv3_3_RS2"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv3_3_RS2"
}

layer{
  name: "conv3_3_RS2_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv3_3_RS2"
  top:       "conv3_3_RS2_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS2"
}

#layer{
# name: "conv3_3_RS2_sil"
# type: "Silence"
# bottom: "conv3_3_RS2_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv4_3_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv4_3_RS2"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv4_3_RS2"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv4_3_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv4_3_RS2"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv4_3_RS2"
}

layer{
  name: "conv4_3_RS2_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv4_3_RS2"
  top:       "conv4_3_RS2_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS2"
}

#layer{
# name: "conv4_3_RS2_sil"
# type: "Silence"
# bottom: "conv4_3_RS2_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv5_3_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv5_3_RS2"
  deletebottom:    true
  #deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv5_3_RS2"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv5_3_RS2"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv5_3_RS2"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv5_3_RS2"
}

layer{
  name: "conv5_3_RS2_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv5_3_RS2"
  top:       "conv5_3_RS2_scl"
  deletebottom: true
  deletetop:    true
  pullsfrom: "conv1_1_RS2"
}

#layer{
# name: "conv5_3_RS2_sil"
# type: "Silence"
# bottom: "conv5_3_RS2_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_RES_template.prototxt #

layer {
  name: "pool_RS4"
  type: "Pooling"
  bottom: "data"
  top: "data_RS4"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 4
    pad: 1
  }
}
# end of piece_RES_template.prototxt

# start of piece_FEATS_template.prototxt #

layer {
  name: "conv1_1_RS4"
  type: "Convolution"
  bottom: "data_RS4"
  deletetop:    true
  top: "conv1_1_RS4"
  param {
    name: "conv1_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv1_1_RS4"
  top: "conv1_1_RS4"
}
layer {
  name: "conv1_2_RS4"
  type: "Convolution"
  bottom: "conv1_1_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv1_2_RS4"
  param {
    name: "conv1_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv1_2_RS4"
  top: "conv1_2_RS4"
}
layer {
  name: "pool1_RS4"
  type: "Pooling"
  bottom: "conv1_2_RS4"
  top: "pool1_RS4"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
	pad: 1
  }
}
layer {
  name: "conv2_1_RS4"
  type: "Convolution"
  bottom: "pool1_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv2_1_RS4"
  param {
    name: "conv2_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1_RS4"
  type: "ReLU"
  deletetop:  false
  bottom: "conv2_1_RS4"
  top: "conv2_1_RS4"
}
layer {
  name: "conv2_2_RS4"
  type: "Convolution"
  bottom: "conv2_1_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv2_2_RS4"
  param {
    name: "conv2_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv2_2_RS4"
  top: "conv2_2_RS4"
}
layer {
  name: "pool2_RS4"
  type: "Pooling"
  bottom: "conv2_2_RS4"
  top: "pool2_RS4"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
	 pad: 1
  }
}
layer {
  name: "conv3_1_RS4"
  type: "Convolution"
  bottom: "pool2_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv3_1_RS4"
  param {
    name: "conv3_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_1_RS4"
  top: "conv3_1_RS4"
}
layer {
  name: "conv3_2_RS4"
  type: "Convolution"
  bottom: "conv3_1_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv3_2_RS4"
  param {
    name: "conv3_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_2_RS4"
  top: "conv3_2_RS4"
}
layer {
  name: "conv3_3_RS4"
  type: "Convolution"
  bottom: "conv3_2_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv3_3_RS4"
  param {
    name: "conv3_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv3_3_RS4"
  top: "conv3_3_RS4"
}
layer {
  name: "pool3_RS4"
  type: "Pooling"
  bottom: "conv3_3_RS4"
  top: "pool3_RS4"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}
layer {
  name: "conv4_1_RS4"
  type: "Convolution"
  bottom: "pool3_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv4_1_RS4"
  param {
    name: "conv4_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_1_RS4"
  top: "conv4_1_RS4"
}
layer {
  name: "conv4_2_RS4"
  type: "Convolution"
  bottom: "conv4_1_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv4_2_RS4"
  param {
    name: "conv4_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_2_RS4"
  top: "conv4_2_RS4"
}
layer {
  name: "conv4_3_RS4"
  type: "Convolution"
  bottom: "conv4_2_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv4_3_RS4"
  param {
    name: "conv4_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv4_3_RS4"
  top: "conv4_3_RS4"
}
layer {
  name: "pool4_RS4"
  type: "Pooling"
  bottom: "conv4_3_RS4"
  top: "pool4_RS4"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1 #2->1
	pad: 1
  }
}
layer {
  name: "conv5_1_RS4"
  type: "Convolution"
  bottom: "pool4_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv5_1_RS4"
  param {
    name: "conv5_1_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2  #1->2
	  dilation: 2	  #1->2
    kernel_size: 3
  }
}
layer {
  name: "relu5_1_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv5_1_RS4"
  top: "conv5_1_RS4"
}
layer {
  name: "conv5_2_RS4"
  type: "Convolution"
  bottom: "conv5_1_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv5_2_RS4"
  param {
    name: "conv5_2_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
	dilation: 2
    kernel_size: 3
  }
}
layer {
  name: "relu5_2_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "conv5_2_RS4"
  top: "conv5_2_RS4"
}
layer {
  name: "conv5_3_RS4"
  type: "Convolution"
  bottom: "conv5_2_RS4"
  deletebottom: true
  deletetop:    true
  top: "conv5_3_RS4"
  param {
    name: "conv5_3_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
	dilation: 2
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3_RS4"
  top: "conv5_3_RS4"
  name: "relu5_3_RS4"
  deletetop:    false
  type: "ReLU"
}

# end of piece_FEATS_template.prototxt

# start of piece_FC_template.prototxt #
layer {
  bottom: "conv5_3_RS4"
#  top: "cue5_RS4"
  top: "pool5_RS4"
#  name: "cue5_RS4"
  name: "pool5_RS4"
  type: "Pooling"
  deletetop:    true
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  bottom: "pool5_RS4"
  top: "cue5_RS4"
  name: "cue5_RS4"
  deletetop:    true
  deletebottom:  true
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  bottom: "cue5_RS4"
  deletetop:    true
  deletebottom: true
  top: "fc6_conv_RS4"
  name: "fc6_conv_RS4"
  type: "Convolution"
  param {
    name: "fc6_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
 convolution_param {
    num_output: 1024 # small: 4096    large: 1024
    pad: 12      # small: 6       large: 12
    dilation: 12    # small: 4 (2x3) large: 12
    kernel_size: 3 # small: 4      large: 3
  }
}

layer {
  name: "relu6_conv_RS4"
  type: "ReLU"
  bottom: "fc6_conv_RS4"
  deletetop:    false
  top: "fc6_conv_RS4"
}
layer {
  name: "drop6_RS4"
  type: "Dropout"
  bottom: "fc6_conv_RS4"
  top: "fc6_conv_RS4"
  deletetop:    false
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "fc7_conv_RS4"
  type: "Convolution"
  bottom: "fc6_conv_RS4"
  top: "fc7_conv_RS4"
  deletetop:    true
  deletebottom: true
  param {
    name: "fc7_a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024	 # small: 4096    large: 1024
    kernel_size: 1
  }
}

layer {
  name: "relu7_conv_RS4"
  type: "ReLU"
  deletetop:    false
  bottom: "fc7_conv_RS4"
  top: "fc7_conv_RS4"
}

layer {
  name: "drop7_conv_RS4"
  type: "Dropout"
  bottom: "fc7_conv_RS4"
  top: "fc7_conv_RS4"
  deletetop:    false
  dropout_param {
    dropout_ratio: 0.5
  }
}


# end of piece_FC_template.prototxt

# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv1_2_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv1_2_RS4"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv1_2_RS4"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv1_2_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv1_2_RS4"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv1_2_RS4"
}

layer{
  name: "conv1_2_RS4_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv1_2_RS4"
  top:       "conv1_2_RS4_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS4"
}

#layer{
# name: "conv1_2_RS4_sil"
# type: "Silence"
# bottom: "conv1_2_RS4_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv2_2_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv2_2_RS4"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv2_2_RS4"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv2_2_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv2_2_RS4"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv2_2_RS4"
}

layer{
  name: "conv2_2_RS4_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv2_2_RS4"
  top:       "conv2_2_RS4_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS4"
}

#layer{
# name: "conv2_2_RS4_sil"
# type: "Silence"
# bottom: "conv2_2_RS4_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv3_3_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv3_3_RS4"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv3_3_RS4"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv3_3_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv3_3_RS4"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv3_3_RS4"
}

layer{
  name: "conv3_3_RS4_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv3_3_RS4"
  top:       "conv3_3_RS4_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS4"
}

#layer{
# name: "conv3_3_RS4_sil"
# type: "Silence"
# bottom: "conv3_3_RS4_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv4_3_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv4_3_RS4"
  deletebottom:    true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv4_3_RS4"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv4_3_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv4_3_RS4"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv4_3_RS4"
}

layer{
  name: "conv4_3_RS4_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv4_3_RS4"
  top:       "conv4_3_RS4_scl"
  deletebottom: true
  deletetop:    true
  #pullsfrom: "conv1_1_RS4"
}

#layer{
# name: "conv4_3_RS4_sil"
# type: "Silence"
# bottom: "conv4_3_RS4_scl"
#}

# end of piece_BNORMCONV_template.prototxt
# start of piece_BNORMCONV_template.prototxt #

layer{
  include: {phase: TRAIN}
  name: "BN_pre_conv5_3_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv5_3_RS4"
  deletebottom:    true
  #deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: false
   }
   top:       "BN_pre_conv5_3_RS4"
}

layer{
  include: {phase: TEST}
  name: "BN_pre_conv5_3_RS4"
  type: "BatchNorm"
  param      {lr_mult: 0} param {lr_mult: 0} param {lr_mult: 0}
  bottom:    "conv5_3_RS4"
  deletebottom: true
  deletetop:    true
  batch_norm_param {
    eps: 1
    use_global_stats: true
   }
   top:       "BN_pre_conv5_3_RS4"
}

layer{
  name: "conv5_3_RS4_scl"
  type: "Power"
  power_param { power: 1 scale: 10 shift: 0}
  bottom:    "BN_pre_conv5_3_RS4"
  top:       "conv5_3_RS4_scl"
  deletebottom: true
  deletetop:    true
  pullsfrom: "conv1_1_RS4"
}

#layer{
# name: "conv5_3_RS4_sil"
# type: "Silence"
# bottom: "conv5_3_RS4_scl"
#}

# end of piece_BNORMCONV_template.prototxt

# start of piece_ASPP_template
layer {
  name: "score_edg_1_0_hole0"
  bottom: "conv1_2_scl"
  top: "score_edg_1_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_1_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_1_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_1_0"
top: "up_edg_1_0"
deletebottom: true
deletetop:    true
#pullsfrom: "${PULLS}"
type: "Interp"
bottom: "score_edg_1_0_hole0"
interp_param { zoom_factor: 1}
}


# start of piece_ASPP_template
layer {
  name: "score_edg_2_0_hole0"
  bottom: "conv2_2_scl"
  top: "score_edg_2_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_2_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_2_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_2_0"
top: "up_edg_2_0"
deletebottom: true
deletetop:    true
#pullsfrom: "${PULLS}"
type: "Interp"
bottom: "score_edg_2_0_hole0"
interp_param { zoom_factor: 2}
}


# start of piece_ASPP_template
layer {
  name: "score_edg_3_0_hole0"
  bottom: "conv3_3_scl"
  top: "score_edg_3_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_3_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_3_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_3_0"
top: "up_edg_3_0"
deletebottom: true
deletetop:    true
#pullsfrom: "${PULLS}"
type: "Interp"
bottom: "score_edg_3_0_hole0"
interp_param { zoom_factor: 4}
}


# start of piece_ASPP_template
layer {
  name: "score_edg_4_0_hole0"
  bottom: "conv4_3_scl"
  top: "score_edg_4_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_4_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_4_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_4_0"
top: "up_edg_4_0"
deletebottom: true
deletetop:    true
#pullsfrom: "${PULLS}"
type: "Interp"
bottom: "score_edg_4_0_hole0"
interp_param { zoom_factor: 8}
}


# start of piece_ASPP_template
layer {
  name: "score_edg_5_0_hole0"
  bottom: "conv5_3_scl"
  top: "score_edg_5_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_5_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_5_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_5_0"
top: "up_edg_5_0"
deletebottom: true
deletetop:    true
#pullsfrom: "${PULLS}"
type: "Interp"
bottom: "score_edg_5_0_hole0"
interp_param { zoom_factor: 8}
}


# start of piece_ASPP_template
layer {
  name: "score_edg_6_0_hole0"
  bottom: "fc7_conv"
  top: "score_edg_6_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_6_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_6_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_6_0"
top: "up_edg_6_0"
deletebottom: true
deletetop:    true
#pullsfrom: "${PULLS}"
type: "Interp"
bottom: "score_edg_6_0_hole0"
interp_param { zoom_factor: 8}
}

# beginning of piece_CONCAT_template
layer {
    name: "edg__00"
    top:  "edg__00"
     bottom: "up_edg_1_0"
     bottom: "up_edg_2_0"
     bottom: "up_edg_3_0"
     bottom: "up_edg_4_0"
     bottom: "up_edg_5_0"
     bottom: "up_edg_6_0"

    type: "Concat"
    deletebottom: true
    deletetop:    true
    concat_param { concat_dim: 1}
}

layer {
    type: "Convolution"
    bottom: "edg__00"
    name: "upscore-fuse-edg__00"
    top: "upscore-fuse-edg__00"
    #deletebottom: true
    deletetop:    true
    param {
        name:  "fuse-edg__00a"
        lr_mult: 1
        decay_mult: 1
    }
    param {
        name:  "fuse-edg__00b"
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 2
        kernel_size: 1
        weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
    }
  # pullsfrom: "score_edg_1_0_hole0"
}
# end of piece_CONCAT_template

 layer { include: {phase: TEST} type: "Softmax"   bottom: "upscore-fuse-edg__00"   name: "sigmoid-upscore-fuse-edg__00"    top: "sigmoid-upscore-fuse-edg__00"}
# start of piece_ASPP_template
layer {
  name: "score_edg_1_RS2_0_hole0"
  bottom: "conv1_2_RS2_scl"
  top: "score_edg_1_RS2_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_1_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_1_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_1_RS2_0"
top: "up_edg_1_RS2_0"
deletebottom: true
deletetop:    true
#pullsfrom: "${PULLS}"
type: "Interp"
bottom: "score_edg_1_RS2_0_hole0"
interp_param { zoom_factor: 2}
}


# start of piece_ASPP_template
layer {
  name: "score_edg_2_RS2_0_hole0"
  bottom: "conv2_2_RS2_scl"
  top: "score_edg_2_RS2_0_hole0"
  deletetop:  true
  type: "Convolution"
  param {
    name: "score_edg_2_0_hole0a"
    lr_mult: 1
    decay_mult: 1
  }
  param {
     name: "score_edg_2_0_hole0b"
    lr_mult: 2
    decay_mult: 0
 }
  convolution_param {
    num_output: 2
    kernel_size: 1
    pad: 0
    dilation: 0
    stride: 1
    weight_filler {      type: "gaussian"      std: 0.001     }   bias_filler {       type: "constant"       value: 0 }
  }

}
# end of piece_ASPP_template

layer {
name: "up_edg_2_RS2_0"
top: "up_edg_2_RS2_0"
deletebottom: true
deletetop:    true
